In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql 

CREATE TABLE employeed(
    id INT,
    first_name VARCHAR(20) NOT NULL,
    last_name VARCHAR(20) NOT NULL,
    date_of_birth DATE NOT NULL,
    district VARCHAR(20) NOT NULL,
    salary NUMERIC(5,2) NOT NULL,
    mobile VARCHAR(15) NOT NULL,
    PRIMARY KEY(id));

INSERT INTO employeed VALUES(1,'James','Mary','1987-01-01','Alabama',125000.00,'15228817386');
INSERT INTO employeed VALUES(2,'Robert','Patricia','1987-01-12','Alaska',86000.00,'6990009999');
INSERT INTO employeed VALUES(3,'Michael','Linda','1989-09-23','Arizona',60000.00,'4066969999');
INSERT INTO employeed VALUES(4,'William','Elizabeth','2000-11-12','Arkansas',120000.00,'2214710999');
INSERT INTO employeed VALUES(5,'Christopher','Nancy','2003-01-01','Alabama',75000.00,'15228817386');
INSERT INTO employeed VALUES(6,'Daniel','Matthew','1993-01-12','Alaska',85000.00,'6990009999');
INSERT INTO employeed VALUES(7,'Anthony','Margaret','1995-10-23','Arizona',35000.00,'4066969999');
INSERT INTO employeed VALUES(8,'Donald','Ashley','2000-11-11','Arkansas',130000.00,'2214710999');
SELECT * from employeed;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 125000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 86000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 60000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 120000, '2214710999'),
 (5, 'Christopher', 'Nancy', '2003-01-01', 'Alabama', 75000, '15228817386'),
 (6, 'Daniel', 'Matthew', '1993-01-12', 'Alaska', 85000, '6990009999'),
 (7, 'Anthony', 'Margaret', '1995-10-23', 'Arizona', 35000, '4066969999'),
 (8, 'Donald', 'Ashley', '2000-11-11', 'Arkansas', 130000, '2214710999')]

In [4]:
%%sql 

SELECT salary, district from employeed;

 * sqlite://
Done.

[(125000, 'Alabama'),
 (86000, 'Alaska'),
 (60000, 'Arizona'),
 (120000, 'Arkansas'),
 (75000, 'Alabama'),
 (85000, 'Alaska'),
 (35000, 'Arizona'),
 (130000, 'Arkansas')]

In [5]:
%%sql 

UPDATE employeed SET district= 'Tampere' WHERE id=5;

 * sqlite://
1 rows affected.

[]

In [6]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 125000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 86000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 60000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 120000, '2214710999'),
 (5, 'Christopher', 'Nancy', '2003-01-01', 'Tampere', 75000, '15228817386'),
 (6, 'Daniel', 'Matthew', '1993-01-12', 'Alaska', 85000, '6990009999'),
 (7, 'Anthony', 'Margaret', '1995-10-23', 'Arizona', 35000, '4066969999'),
 (8, 'Donald', 'Ashley', '2000-11-11', 'Arkansas', 130000, '2214710999')]

In [7]:
%%sql 
SELECT DISTINCT district from employeed;

 * sqlite://
Done.

[('Alabama',), ('Alaska',), ('Arizona',), ('Arkansas',), ('Tampere',)]

In [8]:
%%sql 

DELETE from employeed WHERE id>=5;

 * sqlite://
4 rows affected.

[]

In [9]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 125000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 86000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 60000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 120000, '2214710999')]

In [10]:
%%sql 

INSERT INTO employeed (id,first_name,last_name,date_of_birth,district,salary,mobile) VALUES( 5,'duck','donald','1987-01-12','Kushtia',2500.00,'4405738447458');

 * sqlite://
1 rows affected.

[]

In [11]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 125000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 86000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 60000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 120000, '2214710999'),
 (5, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '4405738447458')]

In [12]:
%%sql 

INSERT INTO employeed (id,first_name,last_name,date_of_birth,district,salary,mobile) VALUES( 6,'duck','donald','1987-01-12','Kushtia',2500.00,'440738447594');

 * sqlite://
1 rows affected.

[]

In [13]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 125000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 86000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 60000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 120000, '2214710999'),
 (5, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '4405738447458'),
 (6, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594')]

In [14]:
%%sql 

UPDATE employeed SET salary= 1000.00 WHERE id=1;
UPDATE employeed SET salary= 2000.00 WHERE id=2;
UPDATE employeed SET salary= 3000.00 WHERE id=3;
UPDATE employeed SET salary= 4000.00 WHERE id=4;
UPDATE employeed SET salary= 5000.00 WHERE id=5;

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'duck', 'donald', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594')]

In [16]:
%%sql 

SELECT * from employeed WHERE salary <=3000 ORDER BY id DESC;

 * sqlite://
Done.

[(6, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (1, 'James', 'Mary', '1987-01-01', 'Alabama', 1000, '15228817386')]

In [17]:
%%sql 

INSERT INTO employeed (id,first_name,last_name,date_of_birth,district,salary,mobile) VALUES( 7,'duck','donald','1987-01-12','Kushtia',2500.00,'');

 * sqlite://
1 rows affected.

[]

In [18]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'duck', 'donald', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '')]

In [19]:
%%sql 

INSERT INTO employeed (id,first_name,last_name,date_of_birth,district,salary,mobile) VALUES( 8,'duck','donald','1987-01-12','Kushtia',2500.00,'0154');

 * sqlite://
1 rows affected.

[]

In [20]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'James', 'Mary', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Robert', 'Patricia', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Michael', 'Linda', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'William', 'Elizabeth', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'duck', 'donald', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, ''),
 (8, 'duck', 'donald', '1987-01-12', 'Kushtia', 2500, '0154')]

In [21]:
%%sql 

UPDATE employeed SET first_name= 'Gary' WHERE id=1;
UPDATE employeed SET first_name= 'Nicholas' WHERE id=2;
UPDATE employeed SET first_name= 'Eric' WHERE id=3;
UPDATE employeed SET first_name= 'Stephen' WHERE id=4;
UPDATE employeed SET first_name= 'Larry' WHERE id=5;
UPDATE employeed SET first_name= 'Justin' WHERE id=6;
UPDATE employeed SET first_name= 'Benjamin' WHERE id=7;
UPDATE employeed SET first_name= 'Samuel' WHERE id=8;

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'Gary', 'Mary', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Nicholas', 'Patricia', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Eric', 'Linda', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'Stephen', 'Elizabeth', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'Larry', 'donald', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'Justin', 'donald', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'Benjamin', 'donald', '1987-01-12', 'Kushtia', 2500, ''),
 (8, 'Samuel', 'donald', '1987-01-12', 'Kushtia', 2500, '0154')]

In [23]:
%%sql 

UPDATE employeed SET first_name= 'George', last_name='Melissa' WHERE id=1;
UPDATE employeed SET first_name= 'Edward', last_name='Deborah' WHERE id=2;
UPDATE employeed SET first_name= 'Abdur Rahman', last_name='Abdullah' WHERE id=3;
UPDATE employeed SET first_name= 'Ronald' , last_name='Stephanie' WHERE id=4;
UPDATE employeed SET first_name= 'Timothy' , last_name='Rebecca' WHERE id=5;
UPDATE employeed SET first_name= 'Jason' , last_name='Laura' WHERE id=6;
UPDATE employeed SET first_name= 'Ryan' , last_name='Cynthia' WHERE id=7;
UPDATE employeed SET first_name= 'Gary' , last_name='Helen' WHERE id=8;

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [24]:
%%sql 

SELECT * from employeed;

 * sqlite://
Done.

[(1, 'George', 'Melissa', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Edward', 'Deborah', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Abdur Rahman', 'Abdullah', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'Ronald', 'Stephanie', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'Timothy', 'Rebecca', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'Jason', 'Laura', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'Ryan', 'Cynthia', '1987-01-12', 'Kushtia', 2500, ''),
 (8, 'Gary', 'Helen', '1987-01-12', 'Kushtia', 2500, '0154')]

In [25]:
%%sql 

SELECT * 
from employeed
WHERE district='Kushtia';

 * sqlite://
Done.

[(5, 'Timothy', 'Rebecca', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'Jason', 'Laura', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'Ryan', 'Cynthia', '1987-01-12', 'Kushtia', 2500, ''),
 (8, 'Gary', 'Helen', '1987-01-12', 'Kushtia', 2500, '0154')]

In [26]:
%%sql 

SELECT * 
from employeed
WHERE date_of_birth > '1980-01-01';

 * sqlite://
Done.

[(1, 'George', 'Melissa', '1987-01-01', 'Alabama', 1000, '15228817386'),
 (2, 'Edward', 'Deborah', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Abdur Rahman', 'Abdullah', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'Ronald', 'Stephanie', '2000-11-12', 'Arkansas', 4000, '2214710999'),
 (5, 'Timothy', 'Rebecca', '1987-01-12', 'Kushtia', 5000, '4405738447458'),
 (6, 'Jason', 'Laura', '1987-01-12', 'Kushtia', 2500, '440738447594'),
 (7, 'Ryan', 'Cynthia', '1987-01-12', 'Kushtia', 2500, ''),
 (8, 'Gary', 'Helen', '1987-01-12', 'Kushtia', 2500, '0154')]

In [27]:
%%sql 

SELECT * 
from employeed
WHERE date_of_birth < '1980-01-01';

 * sqlite://
Done.

[]

In [28]:
%%sql 

SELECT * 
from employeed
WHERE mobile LIKE'%99';

 * sqlite://
Done.

[(2, 'Edward', 'Deborah', '1987-01-12', 'Alaska', 2000, '6990009999'),
 (3, 'Abdur Rahman', 'Abdullah', '1989-09-23', 'Arizona', 3000, '4066969999'),
 (4, 'Ronald', 'Stephanie', '2000-11-12', 'Arkansas', 4000, '2214710999')]